In [1]:
import pandas as pd

In [2]:
import sqlite3

In [5]:
#SQL statements to create a table; name is student score; parenthesis has column name & dtype of column

create_table = """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL);"""

In [6]:
#exceute the SQL statement : using connect method to connect with the memory database 
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [7]:
#prepare an SQl query to fetch data from table 
SQL_query = executeSQL.execute('select * from student_score')

In [8]:
#execute is used to execute and fetchfall is used to fetch data 
resulset = SQL_query.fetchall()

In [9]:
#view resulset is empty as table is empty 

resulset

[]

In [10]:
#insert data into a table using SQL commands
#prepare an SQl statement to insert values/ records into table 
import sqlite3
insertSQL = [(10,'Jack',85,92),(29,'Tom',73,89),(65,'Ram',65.5,77),(5,'Steve',55,91)]

In [12]:
#insert records into SQL table through SQL statement; question marks is syntax
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [13]:
#prepare SQL query
SQL_query =  executeSQL.execute("select * from student_score")

In [14]:
#fetch the result for the query
resulset = SQL_query.fetchall()

In [16]:
# shows all the records present in the table 
resulset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [31]:
 #create a df to store resulset in it; the ZIP method gets all the columns together
import pandas as pd

df_student_recors = pd.DataFrame(resulset,columns=zip(*SQL_query.description)[0])

TypeError: 'zip' object is not subscriptable

In [28]:
df_student_recors

NameError: name 'df_student_recors' is not defined

In [32]:
columns = [col[0] for col in SQL_query.description]

In [33]:
df_student_records = pd.DataFrame(resulset, columns=columns)
df_student_records

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0

In [34]:
#lesson7 ASSIGNMENT